; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	infrared4 - mode
	spectrograph0 - mode
	thermograph1 - mode
	image2 - mode
	infrared3 - mode
	image5 - mode
	Star2 - direction
	Star4 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	GroundStation0 - direction
	Star3 - direction
	GroundStation8 - direction
	Star1 - direction
	Star7 - direction
	Star9 - direction
	Star10 - direction
	Star11 - direction
	Planet12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 infrared3)
	(calibration_target instrument0 GroundStation8)
	(supports instrument1 infrared4)
	(supports instrument1 image5)
	(supports instrument1 thermograph1)
	(supports instrument1 image2)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 thermograph1)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star7)
	(calibration_target instrument2 Star1)
	(calibration_target instrument2 GroundStation8)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star10)
)
(:goal (and
	(pointing satellite0 Star10)
	(have_image Star9 infrared4)
	(have_image Star9 infrared3)
	(have_image Star10 spectrograph0)
	(have_image Star10 infrared4)
	(have_image Star11 infrared4)
	(have_image Planet12 thermograph1)
	(have_image Phenomenon13 image5)
))

)

; plan
1. (turn_to satellite0 groundstation8 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 groundstation8)
   goals met: 0 of 8
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 8
3. (calibrate satellite0 instrument2 groundstation8)
   added: (calibrated instrument2)
   goals met: 0 of 8
4. (turn_to satellite0 star10 groundstation8)
   deleted: (pointing satellite0 groundstation8)
   added: (pointing satellite0 star10)
   goals met: 1 of 8
5. (take_image satellite0 star10 instrument2 spectrograph0)
   added: (have_image star10 spectrograph0)
   goals met: 2 of 8
6. (turn_to satellite0 planet12 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet12)
   goals met: 1 of 8
7. (take_image satellite0 planet12 instrument2 thermograph1)
   added: (have_image planet12 thermograph1)
   goals met: 2 of 8
8. (turn_to satellite0 groundstation8 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 groundstation8)
   goals met: 2 of 8
9. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 2 of 8
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 8
11. (calibrate satellite0 instrument0 groundstation8)
   added: (calibrated instrument0)
   goals met: 2 of 8
12. (turn_to satellite0 star9 groundstation8)
   deleted: (pointing satellite0 groundstation8)
   added: (pointing satellite0 star9)
   goals met: 2 of 8
13. (take_image satellite0 star9 instrument0 infrared3)
   added: (have_image star9 infrared3)
   goals met: 3 of 8
14. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 3 of 8
15. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 8
16. (turn_to satellite0 groundstation0 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation0)
   goals met: 3 of 8
17. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 3 of 8
18. (turn_to satellite0 phenomenon13 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon13)
   goals met: 3 of 8
19. (take_image satellite0 phenomenon13 instrument1 image5)
   added: (have_image phenomenon13 image5)
   goals met: 4 of 8
20. (turn_to satellite0 star11 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 star11)
   goals met: 4 of 8
21. (take_image satellite0 star11 instrument1 infrared4)
   added: (have_image star11 infrared4)
   goals met: 5 of 8
22. (turn_to satellite0 star9 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star9)
   goals met: 5 of 8
23. (take_image satellite0 star9 instrument1 infrared4)
   added: (have_image star9 infrared4)
   goals met: 6 of 8
24. (turn_to satellite0 star10 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star10)
   goals met: 7 of 8
25. (take_image satellite0 star10 instrument1 infrared4)
   added: (have_image star10 infrared4)
   goals met: 8 of 8
